patch/details.org
# -*- mode: org ; coding: utf-8-unix -*-
# last updated : 2021/05/01.19:05:22


#+TITLE:     Patch Details for LLVM
#+AUTHOR:    yaruopooner
#+EMAIL:     [https://github.com/yaruopooner]
#+OPTIONS:   author:nil timestamp:t |:t \n:t ^:nil


* invalidate-mmap.patch
  - Contents
    mmap use invalidation.

  - Detail
    Bug 20880 - Header file mmap lock problem by CXTranslationUnit 
    https://bugs.llvm.org/show_bug.cgi?id=20880

* +bugfix000.patch+
  - Contents
    Fixed out of range access at container.

    Apply this bugfix patch if the LLVM version is 11.0.x or lower.
    This bug is fixed on LLVM 12.0.0.

  - Detail
    Bug 31150 - Out of range access occurs and a crash occurs in llvm/tools/clang/lib/Lex/HeaderSearch.cpp
    https://bugs.llvm.org/show_bug.cgi?id=31150

* +msvc2017-build-error-fixed.patch+
  - Contents
    Fixed compile error.
    I didn't report this error.

  - Detail
    LLVM 4.00 under ? msvc ? : build error fixed patch for msvc2017(update0) & LLVM 4.00 only, this problem fixed at LLVM greater than 4.00.
